 # перше завдання 
n = [1, 2, 3, 8, 99, 12, 88, 88, 12, 88, -55, 662, 0]
x = int(input('Введіть X:'))
y = int(input('Ввудіть Y:'))
l1= []
for i in list(n):
    if i % x== 0 and i % y != 0:
        l1.append(i)
print ('числа, які діляться на X, але не діляться на Y:', *l1)     





# # друге завдання    
m = [ [1,4,6], [1,9,8], [22, 84, 63]]
l2 =[]
for i in m:
    for i2 in i:
        l2.append(i2)
print(l2)



# #третє завдання 



# #четверте завдання ---
z = [1,2,5,7,8,-77, 8888, -2999, 0, 0, 1, 1, 1, 1, 1, 1]
e={}
for i in z:
     
    (z.sort(reverse=True))
print(z)
# for i in z:
#     if i in e:
#         e[i] +=1
#     else:
#         e[i] = 1
# e = sorted(z, key=i, reverse=True)   
# print(*e)



# п'яте завдання 
b = [1, 8 , 9, 0 , -33]
v = [1, 7, 14, -1228]
if len(b) == 5:
    print(v+b)
else:
    print('Не виповнюється умова')


# шосте завдання
c = {
    'Kolya': {'Англійська':10,
              'Українська': 9, 
              'Математика': 9} , 

    'Illa': {'Англійська':12,
              'Українська': 6, 
              'Математика': 11}, 

    'Katya': {'Англійська':10,
              'Українська': 8, 
              'Математика': 7}
    
    }
p= {}
for i in c:
    sum1= sum(c[i].values()) 
    p[i]=sum1
print(p)


# сьоме завдання 
j = [1, 6, 8, 9, 0, -1, 6, -56 , -7]
b =[]
for i in j:
    if i<0:
        b.append(-1*i)
    else:
        b.append(i)
print(*b)



# восьме завдання 
x1= int(input('Введіть X:'))
d = [
    [1,4,5,6,8],
    [4,9,0],
    [222, 8, 6, 5, 8 ,9 ],
]
s=[]
for i in d:
    if len(i)> x1:
        s.append(i)
print("кількість рядків довжиною більше X:", len(s))


# дев'те завдання ---


f = [[1,2,45],
    [1,3,8,8,5],
    [5,8,9,9]
]
l= [
    [1,7,6,8,90],
    [15,7,-11,7],
    [7,8,9,3,8]
]
print(f+l)


# десяте завдання
n1 = [1, 7, 8 , 5, 55, 35479, 2563538, 8353, 29]
n2 = []
x = int(input('Введіть X:'))
y = int(input('Введіть Y:'))
for i in n1:
    if i % x == 0:
        n2.append(y*i)
    else:
        n2.append(i)
print(n2)

